pmo-dataset/variations/mermaid_basic/26.mmd
graph LR
	Task_7["notify social security"] --> ParallelGateway_2{"+"}
	Task_6["notify employer"] --> ParallelGateway_2
	ParallelGateway_2 --> Task_1["receive confirmation from employer"]
	Task_9["do maternity/paternity leave"] --> Task_10["decide if extend leave or return to work"]
	Task_10 --> ExclusiveGateway_1{"X"}
	ExclusiveGateway_1 --> EndEvent_1(("return to job"))
	StartEvent_1((" ")) --> ParallelGateway_3{"+"}
	ParallelGateway_3 --> Task_3["fetch information about financial support"]
	ParallelGateway_3 --> Task_2["fetch information about leave models"]
	Task_3 --> ParallelGateway_4{"+"}
	Task_2 --> ParallelGateway_4
	ParallelGateway_4 --> Task_5["select appropriate model"]
	ExclusiveGateway_2{"X"} --> Task_11["apply for financial support"]
	Task_11 --> ExclusiveGateway_3{"X"}
	Task_12["decide if apply for financial support"] --> ExclusiveGateway_2
	ExclusiveGateway_2 --> ExclusiveGateway_3
	Task_1 --> Task_4["check if all necessary documents gathered"]
	Task_4 --> ExclusiveGateway_4{"X"}
	ExclusiveGateway_4 --> Task_9
	ParallelGateway_1{"+"} --> Task_6
	ParallelGateway_1 --> Task_7
	ExclusiveGateway_4 --> Task_8["prepare necessary documents for leave"]
	ExclusiveGateway_3 --> Task_8
	Task_8 --> ParallelGateway_1
	Task_5 --> Task_12
	ExclusiveGateway_1 --> Task_8
